balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ256MC510A.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="OVDCON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111100000000" edc:name="OVDCON" edc:nzwidth="0x10" edc:por="1111111100000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1OVDCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POUT1L" edc:desc="" edc:mask="0x1" edc:name="POUT1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT1H" edc:desc="" edc:mask="0x1" edc:name="POUT1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT2L" edc:desc="" edc:mask="0x1" edc:name="POUT2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT2H" edc:desc="" edc:mask="0x1" edc:name="POUT2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT3L" edc:desc="" edc:mask="0x1" edc:name="POUT3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT3H" edc:desc="" edc:mask="0x1" edc:name="POUT3H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT4L" edc:desc="" edc:mask="0x1" edc:name="POUT4L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT4H" edc:desc="" edc:mask="0x1" edc:name="POUT4H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD1L" edc:desc="" edc:mask="0x1" edc:name="POVD1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD1H" edc:desc="" edc:mask="0x1" edc:name="POVD1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD2L" edc:desc="" edc:mask="0x1" edc:name="POVD2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD2H" edc:desc="" edc:mask="0x1" edc:name="POVD2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD3L" edc:desc="" edc:mask="0x1" edc:name="POVD3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD3H" edc:desc="" edc:mask="0x1" edc:name="POVD3H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD4L" edc:desc="" edc:mask="0x1" edc:name="POVD4L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD4H" edc:desc="" edc:mask="0x1" edc:name="POVD4H" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PDC1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PDC1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1DC1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PDC1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PDC2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PDC2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1DC2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PDC2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PDC3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PDC3" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1DC3"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC3" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PDC3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PDC4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PDC4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1DC4"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PDC4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnrnnnnnnnnnnnn" edc:cname="QEICON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="QEICON" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="QEI1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UPDN_SRC" edc:desc="" edc:mask="0x1" edc:name="UPDN_SRC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCS" edc:desc="" edc:mask="0x1" edc:name="TQCS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POSRES" edc:desc="" edc:mask="0x1" edc:name="POSRES" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCKPS0" edc:desc="" edc:mask="0x1" edc:name="TQCKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCKPS1" edc:desc="" edc:mask="0x1" edc:name="TQCKPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQGATE" edc:desc="" edc:mask="0x1" edc:name="TQGATE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCDOUT" edc:desc="" edc:mask="0x1" edc:name="PCDOUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWPAB" edc:desc="" edc:mask="0x1" edc:name="SWPAB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEIM0" edc:desc="" edc:mask="0x1" edc:name="QEIM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEIM1" edc:desc="" edc:mask="0x1" edc:name="QEIM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEIM2" edc:desc="" edc:mask="0x1" edc:name="QEIM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPDN" edc:desc="" edc:mask="0x1" edc:name="UPDN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INDX" edc:desc="" edc:mask="0x1" edc:name="INDX" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEISIDL" edc:desc="" edc:mask="0x1" edc:name="QEISIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CNTERR" edc:desc="" edc:mask="0x1" edc:name="CNTERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TQCKPS" edc:desc="" edc:mask="0x3" edc:name="TQCKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEIM" edc:desc="" edc:mask="0x7" edc:name="QEIM" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="QEI" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnn----" edc:cname="DFLTCON" edc:desc="" edc:impl="0x7f0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuuuuuu----" edc:name="DFLTCON" edc:nzwidth="0x10" edc:por="-----0000000----">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="DFLT1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="QECK0" edc:desc="" edc:mask="0x1" edc:name="QECK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QECK1" edc:desc="" edc:mask="0x1" edc:name="QECK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QECK2" edc:desc="" edc:mask="0x1" edc:name="QECK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEOUT" edc:desc="" edc:mask="0x1" edc:name="QEOUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CEID" edc:desc="" edc:mask="0x1" edc:name="CEID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IMV0" edc:desc="" edc:mask="0x1" edc:name="IMV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IMV1" edc:desc="" edc:mask="0x1" edc:name="IMV1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="QECK" edc:desc="" edc:mask="0x7" edc:name="QECK" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IMV" edc:desc="" edc:mask="0x3" edc:name="IMV" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="POSCNT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="POSCNT" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="POS1CNT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POSCNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="POSCNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="MAXCNT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="MAXCNT" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="MAX1CNT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAXCNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="MAXCNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="24"/>
        <edc:SFRDef edc:access="--------rrrrrrrr" edc:cname="I2C1RCV" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="I2C1RCV" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="I2CRCV"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RCV" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="I2C1RCV" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
